//https://pastebin.com/2MaC9xEB - okr kpiyap
using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Runtime.InteropServices;
using System.Security.Cryptography;
using System.Text;
using System.Threading.Tasks;
using __0x9ᵃᵈ1ᶜ69ᶠ6401087558ᶠ3ᶜ741ᶜ92ᵃᶜ2ᵈ90ᶠᵇᶠ67ᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ;

namespace __0xᵈ6ᵉ4ᵇ5ᶠ8ᶜ0530191ᵇ3ᵈᵉ16ᵉ271ᵉᶜ52ᶜᶜ1ᶠᵇ99ᵃ9ᵈᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ {
class __0x9ᵈ68007ᵇ0763ᶜᵇ230ᶠ9034ᵉᶜ96ᶠ52ᵇ39ᵈ03ᵃᵈ630ᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ {
    static void Main(string[] __0x4ᶜᵃᵈᵈ53ᶜ0ᶜ6ᵇᵈ64701ᵉ896ᵇᶜ10ᶜ24ᵉ0ᵇ3ᶜ25703ᵈᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ) {
      __0xᶠ54ᶜᶠᵉ90ᶠ7ᵈ2ᶜ7ᶠᶠᵈ4ᶜ15ᶠᶜ1ᶜᶠ52ᵃ501ᶜ10ᵉᶠ35ᶜᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ.__0xᵈᶜ65ᵈᶠᶜ08ᵇ64ᵃᶜ13ᶜᶠ3ᶠᶜᵇ3ᵉ954576ᵇᶜᶜ619061ᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ();
    }

    static string __0x1ᶠᶠᵇᶠᵉᵃ8ᵃ33ᵈ4405ᶜ24ᵈ9ᶠᶠᵃ756809ᶜᵃ5447ᵈ531ᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ(string __0xᶜ3ᵃ9820ᵃᵇ0ᶠᵇᵃ11ᵉ531ᶠ739ᵉᵃᵈᵃᵇ34ᵇ6ᵈᵈ0ᵉ7076ᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ) {
      __0xᶜ3ᵃ9820ᵃᵇ0ᶠᵇᵃ11ᵉ531ᶠ739ᵉᵃᵈᵃᵇ34ᵇ6ᵈᵈ0ᵉ7076ᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ = Console.ReadLine();
      return __0xᶜ3ᵃ9820ᵃᵇ0ᶠᵇᵃ11ᵉ531ᶠ739ᵉᵃᵈᵃᵇ34ᵇ6ᵈᵈ0ᵉ7076ᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ;
    }

   static void __0xᵈ122279ᶠᵃ801560ᵇᵃᶠ44ᵇ08ᶜ58ᵉ5ᵇᵃᵃ8362ᶜ2960ᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉᵈᵉᵃᵈᶜᵒᵈᵉ() {
     //surname = "qwe";
    }
   }
  }